<?php

use App\Entity\Articles;
use App\Entity\DatesDisabled;

function indexAction()
{
    global $em, $config;

    $articles=$em->getRepository(Articles::class)->findBy([], ['id' => 'DESC']);

    $reviews=[
// 'Карина' => 'Лікар ретельно оглядає дитинку і найголовніше все пояснює доступно, що зникають всі сумніви з питань за якими звертались. І найголовніше, це знання сучасної медицини, а не призначення безліч ліків, які нічого не лікують...',
// 'Наталя' => 'Відмінний лікар, професіонал, приємна у спілкуванні, завжди відповідає на усі запитання, не робить непотрібних призначень. Моя абсолютна довіра, спокій і впевненість.',
// 'Анна' => 'Я давно шукала лікаря, який не буде виписувати десятки препаратів та лікувати те, чого насправді немає.',
// 'Мирослава' => 'Коли в мене виникають якісь запитання можна проконсультуватись онлайн, лікар відповідає відразу! Чудовий лікар, спеціаліст своєї справи!',
// 'Марина' => 'Чуйна, приємна, та обізнана, одним словом - прекрасний лікар.',
// 'Ірина' => 'Дуже розумна, чуйна та сучасна. Завдяки Світлані Степанівні мій малюк, якщо і хворіє, то швидко одужує. Ми завжди чітко виконуємо її призначення та повністью їй довіряємо',
        'Вікторія' => 'Зверталися з дуже різними проблемами зі здоров’ям дитини. Щоразу нам надавали якісну допомогу без зайвих ліків і, при цьому, з ефективним лікуванням',
        'Крістіна' => 'Дуже задоволені прийомом, лікар дуже приємна, уважно вислухала, зробила обстеження та надала чіткі рекомендації',
        'Марія' => 'Пані Світлана чудовий лікар. Вона завжди коментує все що робить, пояснює «що», «чому», «для чого» і «навіщо». Завжди усміхнена, привітна та на позитиві',
        'Юлія' => 'Прекрасний лікар, яка не тільки є прихильником доказової медицини, але і чудово оглядає маленького пацієнта. Задоволена візитами, оглядом та поясненнями',
        'Галя' => 'Напевно єдиний лікар в Чернівцях, який дотримується принципів доказової медицини. Дуже уважно оглядає дітей, завжди детально відповідає на всі запитання',
        'Марина' => 'Мене хвилювало багато запитань, щодо здоров\'я дитини, на які я отримала всі відповіді і навіть більше. Чуйна, приємна, та обізнана, одним словом – прекрасний лікар',
    ];

    /** @var DatesDisabled[] $dates_disabled */
    $dates_disabled=$em->getRepository(DatesDisabled::class)->findAll();

    $close_dates=[];
    foreach ($dates_disabled as $date_disabled)
        $close_dates[]=$date_disabled->getDate()->format('d.m.Y');

    $address=$config['address'];

    ViewHelper::render(compact('articles', 'reviews', 'close_dates', 'address'));
}