<?php

use App\Entity\Articles;
use App\Entity\DatesDisabled;

function indexAction()
{
    global $em, $config;

    $articles=$em->getRepository(Articles::class)->findBy([], ['id' => 'DESC']);

    $reviews=[
        'Вікторія' => 'Зверталися з дуже різними проблемами зі здоров’ям дитини. Щоразу нам надавали якісну допомогу без зайвих ліків і, при цьому, з ефективним лікуванням',
        'Наталя' => 'Відмінний лікар, професіонал, приємна у спілкуванні, завжди відповідає на усі запитання, не робить непотрібних призначень. Моя абсолютна довіра, спокій і впевненість.',
        'Марія' => 'Пані Світлана чудовий лікар. Вона завжди коментує все що робить, пояснює «що», «чому», «для чого» і «навіщо». Завжди усміхнена, привітна та на позитиві',
        'Юлія' => 'Прекрасний лікар, яка не тільки є прихильником доказової медицини, але і чудово оглядає маленького пацієнта. Задоволена візитами, оглядом та поясненнями',
        'Галя' => 'Напевно єдиний лікар в Чернівцях, який дотримується принципів доказової медицини. Дуже уважно оглядає дітей, завжди детально відповідає на всі запитання',
        'Марина' => 'Мене хвилювало багато запитань, щодо здоров\'я дитини, на які я отримала всі відповіді і навіть більше. Чуйна, приємна, та обізнана, одним словом – прекрасний лікар',
    ];

    /** @var DatesDisabled[] $dates_disabled */
    $dates_disabled=$em->getRepository(DatesDisabled::class)->findAll();

    $close_dates=[];
    foreach ($dates_disabled as $date_disabled)
        $close_dates[]=$date_disabled->getDate()->format('d.m.Y');

    $address=$config['address'];
    $tel=$config['tel'];

    ViewHelper::render(compact('articles', 'reviews', 'close_dates', 'address', 'tel'));
}